Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/svd/PIC32CM2532LE00048.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH4_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x42002C00</baseAddress>
         <interrupt>
            <name>TCC1</name>
            <value>59</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x42003000</baseAddress>
         <interrupt>
            <name>TCC2</name>
            <value>60</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC3</name>
         <baseAddress>0x42003400</baseAddress>
         <interrupt>
            <name>TCC3</name>
            <value>61</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TRAM</name>
         <version>U28012.0.0</version>
         <description>TrustRAM</description>
         <groupName>TRAM</groupName>
         <prependToName>TRAM_</prependToName>
         <baseAddress>0x42005400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x6A0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TRAM</name>
            <value>70</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPERS</name>
                     <description>Tamper Erase</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SILACC</name>
                     <description>Silent Access</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>TrustRAM Readout Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ended</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RAMINV</name>
                     <description>RAM Inversion Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRP</name>
                     <description>Data Remanence Prevention Ongoing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy Status</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSCC</name>
               <description>Data Scramble Control</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DSCKEY</name>
                     <description>Data Scramble Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
                  <field>
                     <name>DSCEN</name>
                     <description>Data Scramble Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>128</dim>
               <dimIncrement>4</dimIncrement>
               <name>RAM[%s]</name>
               <description>TrustRAM</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Trust RAM Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
